btn_text = {
    "1": """Мы в восторге от твоей решительности и оперативности, 
осталось дело за малым, присылай скриншот отзыва, и мы с удовольствием подарим тебе 100 руб после того, как прочитаем твои впечатления о товаре Mme pompadour .

Далее мы подробно расскажем, как сделать скриншот, и наши менеджеры оперативно ответят на твои сообщения!


В Личном кабинете WB все оставленные отзывы можно найти в разделе «Профиль»➡️ «Отзывы и вопросы».

❗️ Чтобы вернуться к первому сообщению, жми кнопку "назад".
""",
    "2": """Ты создаешь красоту вместе с нами…
Если ты готова поделиться своими эмоциями от покупки любого товара MMe Pompadour, то мы с удовольствием подарим денежный бонус за твой отзыв на сайте Wildberries.

Опиши продукт, который ты приобрела, что тебе понравилось, расскажи о доставке и сервисе, нам будет очень приятно, если к отзыву ты приложишь несколько фото товара (за каждую фотографию наши заботливые менеджеры посылают лучики добра покупательницам и быстрее отвечают в чатах)

А теперь подробнее, как оставить отзыв?

Следуй по пунктам, и у тебя все получится ❤️:
1️⃣ Зайди в Личный кабинет
2️⃣ Найди раздел “Покупки”
3️⃣ Выбери товар MMe Pompadour, который ты приобрел(-а).
4️⃣ Кликни на “Отзыв”, далее – “Оставить отзыв”
5️⃣ Напиши, чем тебе понравился наш бренд
6️⃣ Кликни “Опубликовать отзыв”
7️⃣ Сделай скриншот готового отзыва и прикрепи в наш чат-бот

❗️ Чтобы вернуться к первому сообщению, жми кнопку "назад".
""",
    "3": """Если у тебя возникли сложности, проблемы или вопрос, то мы с удовольствием поможем тебе и постараемся все решить в ответном сообщении.
Опиши свою проблему…

❗️ Чтобы вернуться к первому сообщению, жми кнопку "назад".
""",
}
