btn_text ={
        "1": """🖥️ «КОД БУДУЩЕГО», УНИВЕРСИТЕТ ИННОПОЛИС И ЛЕТНИЕ КУРСЫ ПО ПРОГРАММИРОВАНИЮ

Этим летом школьники 8-11 классов смогут пройти бесплатное обучение по программированию в Университете Иннополис благодаря проекту Минцифры «Код будущего».

Тебе на выбор предлагается 2 курса:

    1️⃣ Telegramоты на Python
    2️⃣азработка 2D-игр на Python

Какой результат ты получишь?

    ✔ Практические навыки программирования, которые позволят зарабатывать на начальном уровне джун 60-80к, на уровне мидл 100-130к, сеньор 200-250к.
    ✔ Собственную 2D-игру или Telegram-бота.
    ✔ Сертификат Университета Иннополис, подтверждающий полученные навыки.
    ✔ Помощь в подготовке к ЕГЭ и ОГЭ по информатике с разбором реальных задач.
    ✔ Старт в профессии, которая в будущем обеспечит высоким доходом. Минимальная ставка начинающего разработчика — 60к.
        """,
        "2": """🪙 РЕФЕРАЛЬНАЯ ПРОГРАММА. ЧТО ЭТО И ЗАЧЕМ?

Это классная возможность набрать бонусные баллы и обменять их на ценные подарки 🎁

Чтобы участвовать, нужно рассказать другу или однокласснику о бесплатном обучении программированию в Иннополис и прислать ему письмо-приглашение со своей реферальной ссылкой 📨

Друг зарегистрируется по ней и станет участником нашего проекта!
А ты получишь за приглашение одного друга 50 баллов.

Баллы зачисляются на твой бонусный счет после того, как друг пришлет скриншот с успешной регистрацией на Госуслугах.

‼ Внимание! Человек, которому ты отправляешь приглашение, должен учиться в 8-11 классе и быть гражданином РФ.

⚠ А за свою регистрацию ты тоже получаешь стартовые 50 баллов.

Как и на что обменять накопленные бонусы?

✌ 1 БАДДИ балл = 1 рубль

✌ Баллы обмениваются на сертификаты для покупок в OZON, СберМегаМаркет, Золотое яблоко.

✌ Номиналы сертификатов: от 300 руб. и до 300 000 руб.
А потратить свои баллы ты сможешь с 15.06.2023 до 30.06.2023.

Сгенерируй готовое письмо-приглашение с реферальной ссылкой, просто нажав на кнопку ⤵️
Скопируй его и отправь друзьям!
        """ ,
    "3": """Для начала тебе необходимо определиться с курсом, какой курс тебе больше нравитсья ?""",
    "4": """
    🎓 1 курс
    TELEGRAM-БОТЫ НА PYTHON

    🐍 Python — универсальный язык программирования, на котором работают известные IT-компании: Google, Youtube, Netflix, Facebook, Pinterest, Pixar и др.
    Его часто используют для создания ботов в Telegram.

    По итогу курса научишься:
        ▪ регистрировать боты в Telegram;
        ▪ пользоваться технологиями работы с API Telegram;
        ▪ реализовывать базовые алгоритмы;
        ▪ осуществлять обработку сообщений в чат-боте.

        С помощью Python создашь своего 👾 Telegram-бота с полным функционалом.
        """,
        "5": """🎓 2 курс
        РАЗРАБОТКА 2D-ИГР НА PYTHON

        Создание игр — это увлекательное и полезное занятие, оно тренирует последовательное обдумывание действий.

        Чему научишься на курсе:
        ▪ владеть базовыми конструкциями Python;
        ▪ разбираться в особенностях библиотек Arcade и PyGame;
        ▪ работать с анимацией в библиотеках Arcade и PyGame;
        ▪ применять звуки, свет, создавать меню и дополнительные окна.

        🤖 По итогу обучения ты сделаешь 2D-игру с анимированным персонажем и реализацией пользовательского интерфейса.
        """,
}
