btn_text ={
        "1": """🖥️ О ПРОЕКТЕ

“Код Будущего” - федеральный проект Министерства цифрового развития, благодаря которому школьники 8-11 классов и студенты колледжей по всей России смогут пройти бесплатное обучение по программированию в Университете Иннополис.

Тебе на выбор предлагается 6 курсов:

1️⃣ Telegramоты на Python
2️⃣азработка 2D-игр на Python
3️⃣риручи искусственный интеллект: от теории к практике
4️⃣азработка парсеров на Python
5️⃣азработка графических интерфейсов на Python
6️⃣тичный хакинг на Python

Какой результат ты получишь?

✔ Практические навыки программирования, которые позволят зарабатывать на начальном уровне джун 60-80к, на уровне мидл 100-130к, сеньор 200-250к.
✔ Собственный рабочий проект: 2D-игру, парсер или Telegram-бота.
✔ Сертификат Университета Иннополис, подтверждающий полученные навыки.
✔ Помощь в подготовке к ЕГЭ/ОГЭ и олимпиадам по информатике с разбором реальных задач.
✔ Старт в профессии, которая в будущем обеспечит высоким доходом. Минимальная ставка начинающего разработчика — 60к.

👨<200d>💻Подписывайся на наши социальные сети - там мы публикуем интересные материалы, актуальные новости и мемы, стань частью сообщества будущих программистов!

ВК https://vk.com/inno_code
Telegram https://t.me/inno_code
        """,
        "2": """РЕФЕРАЛЬНАЯ ПРОГРАММА - Это классная возможность набрать бонусные баллы и обменять их на ценные подарки 🎁

Чтобы участвовать, нужно рассказать другу или однокласснику о бесплатном обучении программированию в Иннополис и прислать ему письмо-приглашение со своей реферальной ссылкой. 📨

Друг зарегистрируется по ней и станет участником нашего проекта!

За первого приведенного друга дарим 300 баллов
За приглашение каждого следующего одного друга получи  100 баллов.


⚠ А за свою регистрацию ты тоже получаешь стартовые 200 баллов.

Как и на что обменять накопленные бонусы?

✌ 1 БАДДИ балл = 1 рубль

✌ Баллы обмениваются на сертификаты для покупок в OZON, СберМегаМаркет, Золотое яблоко, Спортмастер, Lamoda, Skyeng.

✌ Номиналы сертификатов: от 300 руб. и до 300 000 руб.
А потратить свои баллы ты сможешь с 15.06.2023 до 30.06.2023.

Важно: Баллы зачисляются на твой бонусный счет после того, как твой друг успешно пройдет регистрацию по твоей ссылке.
Человек, которому ты отправляешь приглашение, должен учиться в 8-11 классе и быть гражданином РФ.


Сгенерируй готовое письмо-приглашение с реферальной ссылкой, просто нажав на кнопку ⤵️
Скопируй его и отправь друзьям!
        """ ,
        "3": """Для начала тебе необходимо определиться с курсом, какой курс тебе больше нравитсья ?""",
    "4": """🎓 1 курс TELEGRAM-БОТЫ НА PYTHON

🐍 Python — универсальный язык программирования, на котором работают известные IT-компании: Google, Youtube, Netflix, Facebook, Pinterest, Pixar и др.
Его часто используют для создания ботов в Telegram.

По итогу курса научишься:
▪ регистрировать боты в Telegram;
▪ пользоваться технологиями работы с API Telegram;
▪ реализовывать базовые алгоритмы;
▪ осуществлять обработку сообщений в чат-боте.

С помощью Python создашь своего 👾 Telegram-бота с полным функционалом.
    """,
    "5": """🎓 2 курс
        РАЗРАБОТКА 2D-ИГР НА PYTHON

        Создание игр — это увлекательное и полезное занятие, оно тренирует последовательное обдумывание действий.

        Чему научишься на курсе:
            ▪ владеть базовыми конструкциями Python;
            ▪ разбираться в особенностях библиотек Arcade и PyGame;
            ▪ работать с анимацией в библиотеках Arcade и PyGame;
            ▪ применять звуки, свет, создавать меню и дополнительные окна.

            🤖 По итогу обучения ты сделаешь 2D-игру с анимированным персонажем и реализацией пользовательского интерфейса.
            """,
    "51": """🎓 3 курс
    ПРИРУЧИ ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ: ОТ ТЕОРИИ К ПРАКТИКЕ

    Технологии искусственного интеллекта используется во многих сферах - от маркетинга до медицины. Повышенный спрос на проекты в области ИИ указывает на высокую востребованность специалистов.

    Чему научишься на курсе:
         основам программирования
          применять типы данных и операторов Python
           владеть технологиями Pandas, Numpy, Tensorflow, Scikit-learn
            основам машинного обучения и нейросетей
            """,
    "52": """🎓 4 курс
    СОЗДАНИЕ ПАРСЕРОВ НА PYTHON

    Графические интерфейсы отвечают за взаимодействие программ между пользователем и машинным кодом. Главная задача специалистов сделать интерфейс  интуитивно понятным и удобным.

    🤖 По итогу обучения ты изучишь Python и библиотеку PyQt, освоишь навыки junior-разработчика.

    5. Разработка графических интерфейсов на Python (кратко о курсе)

    🎓 5 курс
    РАЗРАБОТКА ГРАФИЧЕСКИХ ИНТЕРФЕЙСОВ НА PYTHON
    
    Парсинг позволяет автоматически обрабатывать и анализировать данные по определенным параметрам, получать необходимую информацию с сайтов без ручного ввода данных, собирать и структурировать данные для последующего использования. Это помогает ускорить трудоемкую и рутинную работу.

    🤖 По итогу обучения ты изучишь Python и различные библиотеки, чтобы разрабатывать программы для парсеров

    """,
    "53": """🎓 6 курс
    ЭТИЧНЫЙ ХАКИНГ НА PYTHON

    Специалисты в области информационной безопасности занимаются обнаружением и предотвращением вредоносных программ, программ-шпионов и других видов атак. Популярной становится профессия пентестера - они специализируются на поиске уязвимостей. Python нашел широкое применение в сфере кибербезопасности.

    🤖 По итогу обучения ты углубленно изучишь Python  напишешь веб-приложение на Django/Flask и отчет о его безопасности""",
}

    
