MAIN_TEXT = """🤖 БАДДИ — НЕ СОВСЕМ ОБЫЧНЫЙ БОТ.

Я поддержу тебя на всех этапах:
    ✔ объясню, как получить баллы и подарки за регистрацию и участие в программе «Приведи друга»;
    ✔ помогу зарегистрироваться на подходящий тебе курс;
    ✔ помогу решить любой индивидуальный вопрос.


Сейчас расскажу, как мы будем общаться.
Под этим сообщением 3 кнопки:

1️⃣ проекте.
    Здесь ты прочитаешь о проекте «Код будущего» и возможностях, которые он даёт учащимся 8-11 классов.

2️⃣риведи друга.
Информация о реферальной программе:
    ▫ Как в ней участвовать?
    ▫ Что получишь по итогу?
    ▫ Какие будут подарки, и как их забрать?

3️⃣арегистрироваться на курс.
Всё, что нужно для быстрой и успешной регистрации:
    ▫ подробная инструкция из 4-х шагов;
    ▫ описание программ обучения, из которых тебе предстоит выбрать одну;
    ▫ подтверждение регистрации и начисление бонусных баллов.

Смелее переходи к кнопкам ниже ⤵️

"""
TEXT_ANSWER_1 = """🤖 Бадди пока не может начислить тебе бонусные баллы за регистрацию.
Ты точно сделал всё верно?

Если возникли сложности — напиши мне! Вместе мы обязательно разберемся 🙌
    """
TEXT_ANSWER_2 = """ПОЗДРАВЛЯЮ 🎉🎉🎉
Ты успешно сдал тест и прошел регистрацию!
Впереди увлекательное лето с Иннополис!

🪙 Теперь на твоём бонусном счёте прибавились 50 баллов!

Не останавливайся на достигнутом!
Приглашай на интенсив одноклассников и друзей, копи Бадди баллы, чтобы потом получить за них подарки 🎁
    """
SUCCESS_MESSAGE_CARD="Сообщение ок  доставлено"
SUCCESS_MESSAGE_CANCEL="Сообщение не ок доставлено"
~                                                                                                                    ~                                                                                                                    ~                                                                                                                    ~                                                                                                                    ~                                                       
