MAIN_TEXT = """ТВОЙ ПОМОЩНИК НА СВЯЗИ

🤖 Привет! Я — Бадди Бот! Я знаю ответы на все вопросы по проекту “Код будущего”

А еще я очень общительный бот, приводи друзей, а я буду дарить тебе подарки - сертификаты в OZON, Золотое яблоко, Спортмастер, Skyeng и другие магазины и маркетплейсы!

👨<200d>💻 Помочь тебе зарегистрироваться на бесплатные курсы по программированию в Иннополис?
"""
TEXT_ANSWER_1 = """
😥 УПС! ЧТО-ТО ПОШЛО НЕ ТАК…

🤖 Бадди пока не может начислить тебе бонусные баллы за регистрацию.
Ты точно сделал всё верно?

В чем может быть проблема:
    1. Скриншот, который ты прислал - не прошел проверку
    2. Возникли проблемы с регистрацией

Напиши мне! Вместе мы обязательно разберемся 🙌
    """
TEXT_ANSWER_2 = """ПОЗДРАВЛЯЮ 🎉🎉🎉
Ты успешно сдал тест и прошел регистрацию!
Первый шаг на пути к профессии мечты сделан, теперь ты ученик Иннополиса!

❤ Теперь на твоём бонусном счёте появились стартовые 50 баллов!

Не останавливайся на достигнутом!
Приглашай на курсы одноклассников и друзей, копи Бадди баллы, чтобы потом получить за них подарки 🎁
"""
TEXT_ANSWER_3 = """✅  Зачислил тебе дополнительные 100 бадди-баллов, проверь свой бонусный счет!
Жду тебя на обучении, и не забудь позвать друзей  😉"""
TEXT_ANSWER_4 = """❌ ОЙ-ОЙ!
😥 Похоже, промокод неверный, проверь написание и попробуй еще раз!"""

SUCCESS_MESSAGE_CARD="Сообщение Успех доставлено"
SUCCESS_MESSAGE_CARD2="Сообщение +50  доставлено"

SUCCESS_MESSAGE_CANCEL="Сообщение не Успех доставлено"
SUCCESS_MESSAGE_CANCEL2="Сообщение прокод не верный доставлено"
~                                                          
