MAIN_TEXT = """Привет красотка!
Mme Pompadour, поддерживает Твое желание быть роскошной, именно поэтому наш бренд помогает создавать красоту изящно и просто! 
Mme Pompadour ценит своих покупателей, именно поэтому обратная связь очень важна, чтобы и дальше радовать своих прекрасных, энергичных покупательниц!
Не будем терять время, перейдем к приятным моментам! За каждый отзыв о покупке товара Mme Pompadour мы дарим 100 руб (живыми деньгами на карту или телефон)!

Будь ухоженной, женственной и элегантной, сохраняя и поддерживая свою красоту с Mme Pompadour…
Если ты уже оставила отзыв на Wildberries после покупки, то скорее забирай свой подарок!
1️⃣Нажми цифру 1, если уже оставила отзыв
2️⃣Нажми цифру 2, чтобы узнать условия получения промокода (как оставить отзыв)
3️⃣Нажми цифру 3, если возник вопрос / проблема
"""
TEXT_ANSWER_1 = "Извини, но мы не смогли провести проверку, так как условия выполнены не по инструкции, прочитай, пожалуйста, еще раз инструкцию, для этого нажми кнопку «назад», мы очень хотим вручить тебе бонус!"
TEXT_ANSWER_2 = "Замечательно, мы увидели твой отзыв и подтверждение. Мы рады, что продукция Mme Pompadour очень понравилась! Присылай номер телефона или банковской карты, и мы с удовольствием пришлем денежный бонус!"
SUCCESS_MESSAGE_CARD="Сообщение 💳 доставлено"
SUCCESS_MESSAGE_CANCEL="Сообщение ❌ доставлено"
